# mlist = ['1.액션 12000원','2.로코 - 10000원','3.다큐 - 11000원']
# snacklist = ['1.팝콘 6000원','2.스낵콤보 - 8000원','3.건강 - 7000원']
# sitlist = ['1.일반 무료','2.프리미엄 - 5000원','3.vip - 10000원']
mc = [0,12000,10000,11000]
snc = [0,6000,8000,7000]
sic = [0,0,5000,10000]


mlist = {
    1:'액션 12000원',
    2:'로코 - 10000원',
    3:'다큐 - 11000원'
}
snacklist = {
    1:'팝콘 6000원',
    2:'스낵콤보 - 8000원',
    3:'건강 - 7000원'
}
sitlist = {
    1:'일반 무료',
    2:'프리미엄 - 5000원',
    3:'vip - 10000원'
}
a = int(input("영화를 고르세요['1.액션 12000원','2.로코 - 10000원','3.다큐 - 11000원']:"))
b = int(input("간식을 고르세요['1.팝콘 6000원','2.스낵콤보 - 8000원','3.건강 - 7000원']:"))
c = int(input("좌석을 고르세요['1.일반 무료','2.프리미엄 - 5000원','3.vip - 10000원']:"))
print(f"영화는 {mlist[a]}, 간식은 {snacklist[b]}, 좌석은 {sitlist[c]} 이고, 전체 가격은 {(mc[a]+snc[b]+sic[c])}입니다")









